{
  "Index": {
    "title": "Stas Ponomaryov",
    "shortDescription": "Web development, support, consulting, planning",
    "about": "About me",
    "work": "Work",
    "projects": "Projects",
    "contacts": "Contacts",
    "hello_1": "Hi!",
    "myNameIs": "My name is Stas and I love coding.",
    "itStarted": "At first it was a hobby and for a long time I just did it out of curiosity. Back then, in 2006, I didn't even know what web development was.",
    "firstSteps": "Time passed and I became interested in HTML coding. Documentation and the Internet were difficult to reach in those days, but I tried. I understood that sites are not developed in only HTML and dived first in JavaScript, and then in PHP.",
    "processed": "Next, I started working with CMS (Content Management System). One of the first websites I built was powered by WordPress. The purposes of the websites varied, including portfolio sites, blogs, news sites, rating aggregation sites, and more. The more I delved into WordPress, the more I realized that it wasn't a perfect fit for me.",
    "upgraded": "I became interested in frameworks, both in PHP and JavaScript. Especially when I started focusing more on Node.js. Additionally, I have experience with frontend development written without frameworks and optimized for SEO and fast loading.",
    "now": "Now, I have sufficient competence to work on both simple and complex projects, both in frontend and full-stack development. From creating Landing pages to developing Telegram bots, I am ready to take on various challenges. I am open to networking and collaboration opportunities and would be delighted to connect and work together.",
    "resume": "My resume",
    "Development": "Development",
    "Update / Repair / Upgrade": "Update / Repair / Upgrade",
    "SEO, UI optimization": "SEO, UI optimization",
    "developmentDetails": "<p>Full web-sites, portals, Landing pages, E-commerce, SPA, Telehram bots</p>",
    "updateDetails": "<p>Updating and upgrading websites, adding or removing functionality, fixing bugs</p>",
    "optimizationDetails": "<p>Responsive design, speed, productivity, optimizing resources, SEO</p>",
    "buttonOrder": "Order this",
    "buttonHire": "Hire me",
    "buttonAsk": "Consult about",
    "projectsFirstParagraph": "Throughout my time as a developer, I've been involved in various projects spanning diverse domains. These projects have encompassed a wide range of activities, from crafting websites for non-profit organizations to developing e-commerce platforms for spare parts. I've worked on news websites, municipal portals, and even engaged in tasks like API development and creating Telegram bots. My experiences have included tasks like web scraping and transitioning between different content management systems.",
    "projectsSecondParagraph": "While I could showcase my portfolio with screenshots and links to my works, to be honest, I'm feeling a bit lazy and I'll just recall the projects without mentioning specific names or companies that commissioned them. I believe that true competency isn't solely defined by examples of past work, though they are important. It's truly established through direct conversations with the clients and stakeholders. That's my perspective. Why not <link>ask me</link> about that?",
    "contactsFirstParagraph": "You can write down my contact details, call or use the feedback form.",
    "contactsSecondParagraph": "To be sure of receiving an answer, try to write on the topic, explain briefly and to the point.",
    "webDeveloper": "web developer",
    "phone": "Phone",
    "email": "Email",
    "homePage": "Home page"
  },
  "Error": {
    "title": "Something went wrong!",
    "description": "<p>We've unfortunately encountered an error.</p><p>You can try to <retry>reload the page</retry> you were visiting.</p>"
  },
  "NotFoundPage": {
    "title": "Page not found",
    "description": "Please double-check the browser address bar or use the navigation to go to a known page."
  }
}