{
  "Index": {
    "title": "Стас Пономарьов",
    "shortDescription": "Веб-розробка, підтримка, консультування, планування",
    "about": "Про мене",
    "work": "Послуги",
    "projects": "Проєкти",
    "contacts": "Контакти",
    "hello_1": "Привіт!",
    "myNameIs": "Мене звати Стас і я люблю кодинг.",
    "itStarted": "Спочатку це було хобі та довгий час я просто займався цим із цікавості. Тоді, 2006-го року я навіть не знав, що таке веб-розробка.",
    "firstSteps": "Час ішов та я почав цікавитися версткою. З літературою та інтернетом у ті часи було важкувато, але я старався. Зрозумів, що однією версткою сайти не розробляються і поглинув спочатку в JavaScript, а потім і у PHP.",
    "processed": "Далі я почав працювати з CMS. Одним з перших сайтів, який я зробив мав \"під капотом\" Wordpress. Призначення сайтів було різним: сайти-візитки, сайти-блоги, сайти новин, сайти з агрегацією рейтингу тощо. Чим більше я поглиблювався у Wordpress, тим більше я розумів, що мені там тісно.",
    "upgraded": "Мені стали цікаві фреймворки, причому як PHP Javascript. Особливо, коли я став більше приділяти увагу Node JS. Фронтенд, написаний без фреймворків та оптимізований для SEO та швидкісного завантаження теж присутній у моєму досвіді. ",
    "now": "Зараз я маю достатню компетентність для виконання як простих так і серйозних проектів як у фронтенді, так і фул-стек факторі. Починаючи від Landing page та закінчуючи Телеграм-ботами. Буду радий знайомству та співпраці.",
    "resume": "Моє резюме",
    "Development": "Розробка",
    "Update / Repair / Upgrade": "Оновлення / Правки / Апгрейд",
    "SEO, UI optimization": "SEO, UI оптимізація",
    "developmentDetails": "<p>Повноцінні веб-сайти, портали, Landing pages, інтернет-магазини, односторінкові веб-сторінки, Телеграм-боти</p>",
    "updateDetails": "<p>Оновлення, \"прокачка\" сайтів, додавання чи доповнення або прибирання зайвого функціоналу, виправлення помилок</p>",
    "optimizationDetails": "<p>Адаптивність, швидкість завантаження, продуктивність, оптимізація ресурсів, SEO</p>",
    "buttonOrder": "Замовити це",
    "buttonHire": "Найняти мене",
    "buttonAsk": "Проконсультувати",
    "projectsFirstParagraph": "За весь час роботи розробником я приймав участь у різноманітних проєктах. Це були різні напрями діяльності - від сайтів громадських організацій до інтернет-магазинів запчастин. Від сайтів новин до міських порталів. Це було як розробка API, так і написання ботів для Телеграм. Від парсингу сайтів до переносу на інші CMS.",
    "projectsSecondParagraph": "Тут могло би бути моє портфоліо зі скріншотами моїх робіт чи з посиланнями на сайти, але, чесно кажучи, мені лінь і я лиш пригадаю проєкти без назв та компаній, які їх замовляли. Компетентність не визначається прикладами робіт, хоча це і важливо, - вона визначається у розмові з безпосереднім замовником. Так я вважаю. Чому б вам не <link>запитати про це?</link>",
    "contactsFirstParagraph": "Ви можете записати мої контактні дані, зателефонувати або скористатися формою зворотного зв'язку.",
    "contactsSecondParagraph": "Щоб бути впевненим у отриманні відповіді, намагайтеся писати на тему, викладати коротко і по суті.",
    "webDeveloper": "веб-розробник",
    "phone": "Телефон",
    "email": "Ел. пошта",
    "homePage": "Домашня сторінка",
    "introduceYourself": "Будь ласка, представтеся та вкажіть вашу електронну пошту, це буде гарантією відповіді на ваш лист.",
    "create": "Розробка",
    "hire": "Допрацювання",
    "ask": "Оптимізація",
    "whatIsYourName": "Як вас звати?",
    "youCanWriteHere": "Ви можете написати мені тут",
    "send": "Відправити",
    "sent": "Дякую, листа надіслано!"
  },
  "Error": {
    "title": "Здається, щось не так!",
    "description": "<p>На жаль, виникла помилка.</p><p>Ви можете спробувати <retry>перезавантажити сторінку</retry> яку ви переглядали.</p>",
    "nameRequired": "Ім'я - обов'язкове поле",
    "emailRequired": "Email - обов'язкове поле",
    "subjectRequired": "Оберіть, будь ласка, тему",
    "emailInvalid": "Неправильний email"
  },
  "NotFoundPage": {
    "title": "Сторінку не знайдено",
    "description": "Перевірте, будь ласка, адресний рядок браузера."
  }
}